import Image from "next/image"
import { useRouter } from "next/router"

export default function SingleSpecialCoffee() {
    const specialCoffeeArry = [
        {
            id: "1",
            title: " دانکین دونات گلوریا جینز",
            des: "دانه‌های قهوه خشک به درجات مختلف برشته می‌شوند، بسته به عطر و طعم مورد نظر ‌است دانه‌های قهوه خشک به درجات مختلف برشته می‌شوند، بسته به عطر و طعم مورد نظر ‌استدانه‌های قهوه خشک به درجات مختلف برشته می‌شوند، بسته به عطر و طعم مورد نظر ‌است",
            img: "/c-1.png"
        },
        {
            id: "2",
            title: "کازینو کاستا استارباکس",
            des: "دانه‌های قهوه خشک به درجات مختلف برشته می‌شوند، بسته به عطر و طعم مورد نظر ‌است دانه‌های قهوه خشک به درجات مختلف برشته می‌شوند، بسته به عطر و طعم مورد نظر ‌استدانه‌های قهوه خشک به درجات مختلف برشته می‌شوند، بسته به عطر و طعم مورد نظر ‌است",
            img: "/c-2.png"
        },
        {
            id: "3",
            title: "کازینو موکا السالوادور",
            des: "دانه‌های قهوه خشک به درجات مختلف برشته می‌شوند، بسته به عطر و طعم مورد نظر ‌است دانه‌های قهوه خشک به درجات مختلف برشته می‌شوند، بسته به عطر و طعم مورد نظر ‌استدانه‌های قهوه خشک به درجات مختلف برشته می‌شوند، بسته به عطر و طعم مورد نظر ‌است",
            img: "/c-3.png"
        },
        {
            id: "4",
            title: " دانکین دونات گلوریا جینز",
            des: "دانه‌های قهوه خشک به درجات مختلف برشته می‌شوند، بسته به عطر و طعم مورد نظر ‌است دانه‌های قهوه خشک به درجات مختلف برشته می‌شوند، بسته به عطر و طعم مورد نظر ‌استدانه‌های قهوه خشک به درجات مختلف برشته می‌شوند، بسته به عطر و طعم مورد نظر ‌است",
            img: "/c-1.png"
        },
        {
            id: "5",
            title: "کازینو کاستا استارباکس",
            des: "دانه‌های قهوه خشک به درجات مختلف برشته می‌شوند، بسته به عطر و طعم مورد نظر ‌است دانه‌های قهوه خشک به درجات مختلف برشته می‌شوند، بسته به عطر و طعم مورد نظر ‌استدانه‌های قهوه خشک به درجات مختلف برشته می‌شوند، بسته به عطر و طعم مورد نظر ‌است",
            img: "/c-2.png"
        },
        {
            id: "6",
            title: "کازینو موکا السالوادور",
            des: "دانه‌های قهوه خشک به درجات مختلف برشته می‌شوند، بسته به عطر و طعم مورد نظر ‌است دانه‌های قهوه خشک به درجات مختلف برشته می‌شوند، بسته به عطر و طعم مورد نظر ‌استدانه‌های قهوه خشک به درجات مختلف برشته می‌شوند، بسته به عطر و طعم مورد نظر ‌است",
            img: "/c-3.png"
        },
    ]
    const router = useRouter()
    const specialCoffee = specialCoffeeArry.filter(coffee => coffee.id === router.query.id)

    return (
        <>
            <div className="w-full flex items-center justify-center">
                <div className="w-[50%] sm:w-[95%]">
                    {
                        specialCoffee.map(item => (
                            <div key={item.id}>
                                <Image
                                    className="w-full"
                                    src={"/blog1.jpg"} width={300} height={300} alt="..." />
                                <div className="flex gap-4 flex-col text-center">
                                    <h1 className="my-8 text-2xl font-bold ">
                                        {item.title}
                                    </h1>
                                    <p className="text-start leading-10 text-gray-800">
                                        {item.des}
                                    </p>
                                </div>
                            </div>
                        ))
                    }
                </div>
            </div>
        </>
    )
}